Notes/20211028133315-former_project_example_analysis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Former project example analysis</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">Former project example analysis</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-11-15.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbdc0794">AR Ant poster</a>
<ul>
<li><a href="#org2ea7438">What went well?</a></li>
<li><a href="#org466ea9e">What could be better?</a></li>
<li><a href="#org58403ff">What can I learn?</a></li>
<li><a href="#org4a338e6">How will this influence my project?</a></li>
</ul>
</li>
<li><a href="#orge4ee21c">Embroidered family tree</a>
<ul>
<li><a href="#orgd8505ee">What went well?</a></li>
<li><a href="#orgff4574b">What could be better?</a></li>
<li><a href="#orgbb57d5f">What can I learn?</a></li>
<li><a href="#org7b714cc">How will this influence my project?</a></li>
</ul>
</li>
<li><a href="#orgff3eac4">Hydroponics</a>
<ul>
<li><a href="#orgbcc2a5c">What went well?</a></li>
<li><a href="#orge91cade">What could be better?</a></li>
<li><a href="#org724dbd5">What can I learn?</a></li>
<li><a href="#org8e071a5">How will this influence my project?</a></li>
</ul>
</li>
<li><a href="#org40c1301">Computer game</a>
<ul>
<li><a href="#org0efb9c5">What went well?</a></li>
<li><a href="#org6c43a10">What could be better?</a></li>
<li><a href="#orgbc7798c">What can I learn?</a></li>
<li><a href="#orgc1befa4">How will this influence my project?</a></li>
</ul>
</li>
<li><a href="#orgb4ad84e">Science animations</a>
<ul>
<li><a href="#org0972f56">What went well?</a></li>
<li><a href="#orgfbd7bca">What could be better?</a></li>
<li><a href="#org56193f2">What can I learn?</a></li>
<li><a href="#org97cbe09">How will this influence my project?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://moodle.hrsfc.ac.uk/mod/folder/view.php?id=1064">If you're in the hrsfc moodle, you'll be able to view the projects discussed by clicking on this link</a>. Unfortunately if you're not then I won't be able to publish the projects as they are not my work &amp; I have no contact with these students, no way to get contact with these students, and no desire to ask them for permission to publish their projects. Sorry about that.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
For each project:
</p>
<ul class="org-ul">
<li>What are the strengths and weaknesses?</li>
<li>What can you learn from these?</li>
<li>How will this influence the way you work?</li>
</ul>

<div id="outline-container-orgbdc0794" class="outline-2">
<h2 id="orgbdc0794">AR Ant poster</h2>
<div class="outline-text-2" id="text-orgbdc0794">
</div>
<div id="outline-container-org2ea7438" class="outline-3">
<h3 id="org2ea7438">What went well?</h3>
<div class="outline-text-3" id="text-org2ea7438">
<ul class="org-ul">
<li>They did quite a lot of primary research, which was really good</li>
</ul>
</div>
</div>
<div id="outline-container-org466ea9e" class="outline-3">
<h3 id="org466ea9e">What could be better?</h3>
<div class="outline-text-3" id="text-org466ea9e">
<ul class="org-ul">
<li>The text-scaling is hard to read on the 'overall end project' page, more focus could have been given to the accessibility of the project PDF</li>
<li>Some bits of text render over others in the PDF</li>
</ul>
</div>
</div>
<div id="outline-container-org58403ff" class="outline-3">
<h3 id="org58403ff">What can I learn?</h3>
<div class="outline-text-3" id="text-org58403ff">
<ul class="org-ul">
<li>Making sure your project notes are readable is important; if people can't read your project they're not going to rate it very highly</li>
<li>Primary research can be useful; remember people around you who have the skills and tools which you will be using</li>
</ul>
</div>
</div>
<div id="outline-container-org4a338e6" class="outline-3">
<h3 id="org4a338e6">How will this influence my project?</h3>
<div class="outline-text-3" id="text-org4a338e6">
<ul class="org-ul">
<li>I will proofread work to ensure that it is readable &amp; accessible</li>
<li>I know <a href="../Documents/questioning-a-co-owner.html">the people who will be using the project</a>, as well as someone who works at <a href="https://docker.com">docker</a>, so it'd be possible to ask them about what my project needs &amp; what exists in docker to do some useful primary research</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge4ee21c" class="outline-2">
<h2 id="orge4ee21c">Embroidered family tree</h2>
<div class="outline-text-2" id="text-orge4ee21c">
</div>
<div id="outline-container-orgd8505ee" class="outline-3">
<h3 id="orgd8505ee">What went well?</h3>
<div class="outline-text-3" id="text-orgd8505ee">
<ul class="org-ul">
<li>Evaluates reliability of sources</li>
<li>Says what weaknesses there are in the final project (gender bias)</li>
</ul>
</div>
</div>
<div id="outline-container-orgff4574b" class="outline-3">
<h3 id="orgff4574b">What could be better?</h3>
<div class="outline-text-3" id="text-orgff4574b">
<ul class="org-ul">
<li>Had to print out the family tree in sections &amp; would have wasted paper on printing logos without screenshotting workaround; this shows a lack of planning in what website to use</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb57d5f" class="outline-3">
<h3 id="orgbb57d5f">What can I learn?</h3>
<div class="outline-text-3" id="text-orgbb57d5f">
<ul class="org-ul">
<li>It may be a good idea to plan what tools will be used based on what will need to be done with them</li>
<li>Looking at weaknesses, both of sources and of the final project is an important part of evaluation</li>
</ul>
</div>
</div>
<div id="outline-container-org7b714cc" class="outline-3">
<h3 id="org7b714cc">How will this influence my project?</h3>
<div class="outline-text-3" id="text-org7b714cc">
<ul class="org-ul">
<li>I will attempt to evaluate reliability of sources, although it may not always be relevant to do so (for example documentation will almost always be 100% reliable). Benchmarking, on the other hand, may be easier to have reliability scores</li>
<li>I will evaluate the tools, libraries etc. that I will be using based on their features and what I need them to do. An example of an evaluation for a tool is <a href="20211028204303-why_switch_from_notion.html#ID-c83a9bd1-2a46-47f7-9cec-d5b42d473eb4">this, on why I'm using org-mode instead of notion</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgff3eac4" class="outline-2">
<h2 id="orgff3eac4">Hydroponics</h2>
<div class="outline-text-2" id="text-orgff3eac4">
</div>
<div id="outline-container-orgbcc2a5c" class="outline-3">
<h3 id="orgbcc2a5c">What went well?</h3>
<div class="outline-text-3" id="text-orgbcc2a5c">
<ul class="org-ul">
<li>Explanation at the start of what hydroponics is, as I didn't know what hydroponics was at the start this was useful</li>
</ul>
</div>
</div>
<div id="outline-container-orge91cade" class="outline-3">
<h3 id="orge91cade">What could be better?</h3>
<div class="outline-text-3" id="text-orge91cade">
<ul class="org-ul">
<li>There were a lot of diary entries that were essentially empty, and it feels like it could have been condensed a little more in places</li>
</ul>
</div>
</div>
<div id="outline-container-org724dbd5" class="outline-3">
<h3 id="org724dbd5">What can I learn?</h3>
<div class="outline-text-3" id="text-org724dbd5">
<ul class="org-ul">
<li>Again, the effectiveness of the diary entries are really important. I saw another project that used color-coding on this, which really helped to make the important information more visible, and is something I'll probably be doing in my project</li>
<li>Adding explanations for terms the reader does not understand may be important for my project</li>
</ul>
</div>
</div>
<div id="outline-container-org8e071a5" class="outline-3">
<h3 id="org8e071a5">How will this influence my project?</h3>
<div class="outline-text-3" id="text-org8e071a5">
<ul class="org-ul">
<li>I'll explain things that the average person would not understand, as I am aware that I have some specialist knowledge going in to making my project</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org40c1301" class="outline-2">
<h2 id="org40c1301">Computer game</h2>
<div class="outline-text-2" id="text-org40c1301">
</div>
<div id="outline-container-org0efb9c5" class="outline-3">
<h3 id="org0efb9c5">What went well?</h3>
<div class="outline-text-3" id="text-org0efb9c5">
<ul class="org-ul">
<li>Demonstration video worked well as a presentation format, as it allowed explanation alongside an example of the project working</li>
</ul>
</div>
</div>
<div id="outline-container-org6c43a10" class="outline-3">
<h3 id="org6c43a10">What could be better?</h3>
<div class="outline-text-3" id="text-org6c43a10">
<ul class="org-ul">
<li>Didn't have a lot of time to iron out bugs (not very much time to tweak combat, walking animation glitches, general jankiness of pathfinding)</li>
</ul>
</div>
</div>
<div id="outline-container-orgbc7798c" class="outline-3">
<h3 id="orgbc7798c">What can I learn?</h3>
<div class="outline-text-3" id="text-orgbc7798c">
<ul class="org-ul">
<li>Doing a large project can lead you to not have enough time to polish stuff well enough, scalability is important in project choice, as is polishing as you go along rather than implementing a lot and ultimately getting a worse result</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1befa4" class="outline-3">
<h3 id="orgc1befa4">How will this influence my project?</h3>
<div class="outline-text-3" id="text-orgc1befa4">
<ul class="org-ul">
<li>I'll incrementally add features in order of importance, polishing acceptably at each level rather than leaving that until the end</li>
<li>My project would also work well with the format of a demonstration video, which I'll do at the end of the project</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb4ad84e" class="outline-2">
<h2 id="orgb4ad84e">Science animations</h2>
<div class="outline-text-2" id="text-orgb4ad84e">
</div>
<div id="outline-container-org0972f56" class="outline-3">
<h3 id="org0972f56">What went well?</h3>
<div class="outline-text-3" id="text-org0972f56">
<ul class="org-ul">
<li>Their 'evaluation of sources' page is really well-made, showing relevance and quality alongside sources is a great idea</li>
<li>In general, the documentation that they've produced seels to be very high-quality</li>
<li>Their time-tracking allowed them to see how far they were through their project and rectify initial issues with being behind</li>
</ul>
</div>
</div>
<div id="outline-container-orgfbd7bca" class="outline-3">
<h3 id="orgfbd7bca">What could be better?</h3>
<div class="outline-text-3" id="text-orgfbd7bca">
<ul class="org-ul">
<li>The initial idea of the project was too ambitious</li>
</ul>
</div>
</div>
<div id="outline-container-org56193f2" class="outline-3">
<h3 id="org56193f2">What can I learn?</h3>
<div class="outline-text-3" id="text-org56193f2">
<ul class="org-ul">
<li>Scheduling time properly can be very important for proper project management</li>
</ul>
</div>
</div>
<div id="outline-container-org97cbe09" class="outline-3">
<h3 id="org97cbe09">How will this influence my project?</h3>
<div class="outline-text-3" id="text-org97cbe09">
<ul class="org-ul">
<li>I'll spend a lot more time on creating intuitive and useful documentation than I otherwise would have, and I'll look at what other students have done in their documentation for inspiration</li>
<li>I'll put time-management processes and planning in from the start, <a href="daily/2021-10-28.html#ID-8d39261e-e994-45ef-a06e-8a72dea32fff">adding them to today's task list</a>. The suggested time on an EPQ is 2h/w, so I'll schedule that much to start with and evaluate how far I get with that, tweaking as needed</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
You may still find this page to be useful in the 'what can I learn' and 'how will this influence my project' sections of each evaluation 
</p></div></div>


</div>
</div></div>
</body>
</html>
